      * We have to indent by 7 spaces, because... because!

       IDENTIFICATION DIVISION.
       PROGRAM-ID. DAY02.
       PROCEDURE DIVISION.
       DISPLAY "Hello World!".
       STOP RUN.
